## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_key_vault.default will be created
  + resource "azurerm_key_vault" "default" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "049a4264-d53c-47da-ba4b-d8f2dc8ff057"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = (known after apply)
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-353-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "s177d01-ntp-pr-353"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + tenant_id                     = "9c7d9dd3-840c-4b3f-818e-552865082e16"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fatpredisconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpRedis"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = "fatpadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-353-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-353"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
    }

  # azurerm_postgresql_flexible_server_configuration.default will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "default" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-pr-353-db"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.firewall_rule["s177d01-ntp-PSQL-fwrule"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "firewall_rule" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "s177d01-ntp-PSQL-fwrule"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_redis_cache.default will be created
  + resource "azurerm_redis_cache" "default" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "find-a-tp-pr-353-redis-cache"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-353"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353applogs"
      + expiry            = "2024-06-13T00:00:00Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2023-06-13T00:00:00Z"

      + permissions {
          + add    = false
          + create = false
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353httplogs"
      + expiry            = "2024-06-13T00:00:00Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2023-06-13T00:00:00Z"

      + permissions {
          + add    = false
          + create = false
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.dns_a_record_set.web_app_service_ip_address will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_app_service_ip_address" {
      + addrs = (known after apply)
      + host  = (known after apply)
      + id    = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.web_app_service will be created
  + resource "azurerm_application_insights" "web_app_service" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "find-a-tp-pr-353-insights"
      + resource_group_name                   = "s177d01-ntp-pr-353"
      + retention_in_days                     = 30
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0] will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-353-cdnendpoint"
      + tags                     = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_firewall_policy.waf[0] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      + custom_block_response_body        = "PGh0bWw+CjxoZWFkZXI+PHRpdGxlPkZvcmJpZGRlbjwvdGl0bGU+PC9oZWFkZXI+Cjxib2R5PgpGb3JiaWRkZW4KPC9ib2R5Pgo8L2h0bWw+Cg=="
      + custom_block_response_status_code = 403
      + enabled                           = true
      + frontend_endpoint_ids             = (known after apply)
      + id                                = (known after apply)
      + mode                              = "Prevention"
      + name                              = "findatppr353waf"
      + resource_group_name               = "s177d01-ntp-pr-353"
      + sku_name                          = "Standard_AzureFrontDoor"
      + tags                              = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "RateLimiting"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 300
          + type                           = "RateLimitRule"

          + match_condition {
              + match_values       = [
                  + "/.*",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "RegEx"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "find-a-tp-pr-353origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 500
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin_group.group[0] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "find-a-tp-pr-353-origingroup"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 30
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "GET"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_profile.cdn[0] will be created
  + resource "azurerm_cdn_frontdoor_profile" "cdn" {
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-353-cdn"
      + resource_group_name      = "s177d01-ntp-pr-353"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "find-a-tp-pr-353route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_security_policy.waf[0] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "waf" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "findatppr353wafsecuritypolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be created
  + resource "azurerm_linux_web_app" "default" {
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "find-a-tp-pr-353"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "s177d01-ntp-pr-353"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + tags                              = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + virtual_network_subnet_id         = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Information"

              + azure_blob_storage {
                  + level             = "Information"
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/"
          + http2_enabled                           = true
          + ip_restriction                          = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = (known after apply)
                        },
                    ]
                  + name        = "Allow CDN Traffic"
                  + priority    = 65000
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = 1

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.web_app_service will be created
  + resource "azurerm_log_analytics_workspace" "web_app_service" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westeurope"
      + name                               = "find-a-tp-pr-353-webappservice"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "s177d01-ntp-pr-353"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                       = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "web_app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-353-webappservice"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway.default[0] will be created
  + resource "azurerm_nat_gateway" "default" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-353-default"
      + resource_group_name     = "s177d01-ntp-pr-353"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway_public_ip_association.default[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "default" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-353-webappserviceinfransg"
      + resource_group_name = "s177d01-ntp-pr-353"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = (known after apply)
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowFrontdoor"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureFrontDoor.Backend"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_public_ip.nat_gateway[0] will be created
  + resource "azurerm_public_ip" "nat_gateway" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-353-natgateway"
      + resource_group_name     = "s177d01-ntp-pr-353"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "s177d01-ntp-pr-353"
      + tags     = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_route_table.default[0] will be created
  + resource "azurerm_route_table" "default" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-353-default"
      + resource_group_name           = "s177d01-ntp-pr-353"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_service_plan.default will be created
  + resource "azurerm_service_plan" "default" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "find-a-tp-pr-353"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "s177d01-ntp-pr-353"
      + sku_name                     = "S1"
      + tags                         = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + worker_count                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] will be created
  + resource "azurerm_storage_account" "logs" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "findatppr353logs"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "s177d01-ntp-pr-353"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["app"] will be created
  + resource "azurerm_storage_container" "logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "find-a-tp-pr-353applogs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "findatppr353logs"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["http"] will be created
  + resource "azurerm_storage_container" "logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "find-a-tp-pr-353httplogs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "findatppr353logs"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet" "web_app_service_infra_subnet" {
      + address_prefixes                               = [
          + "172.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-353-webappserviceinfra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-353"
      + virtual_network_name                           = "find-a-tp-pr-353-default"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.app_service[0] will be created
  + resource "azurerm_subnet_nat_gateway_association" "app_service" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_network_security_group_association.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_route_table_association.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet_route_table_association" "web_app_service_infra_subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be created
  + resource "azurerm_virtual_network" "default" {
      + address_space       = [
          + "172.0.0.0/12",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-353-default"
      + resource_group_name = "s177d01-ntp-pr-353"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.
```
</details>